In [2]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [3]:
password = getpass()

········

In [4]:
#1
#Establish a connection between Python and the Sakila database.

In [5]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [11]:
data = pd.read_sql_query('SELECT * FROM sakila.actor', engine)
#data.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [6]:
#2
#function called rentals_month. 
#input three parameters:engine, month, year
#execute a SQL query to retrieve the rental data for the specified month and year from rental table
# return it as a pandas DataFrame.

In [15]:
def rentals_month(engine, month, year):
    
    # SQL query to retrieve rental data for the specified month and year
    query = f'''
        SELECT
            r.*,
            c.first_name,
            c.last_name
        FROM
            rental r
            JOIN customer c USING(customer_id) 
        WHERE
            MONTH(r.rental_date) = {month}
            AND YEAR(r.rental_date) = {year}
    '''
    # return it as a pandas DataFrame.
    rental_month_df = pd.read_sql_query(query, engine)
    
    return rental_month_df

In [18]:
# trial
month = 8
year = 2005

trial = rentals_month(engine, month, year)
trial

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,first_name,last_name
0,10437,2005-08-01 08:51:04,14,1,2005-08-10 12:12:04,1,2006-02-15 21:30:53,MARY,SMITH
1,11299,2005-08-02 15:36:52,3232,1,2005-08-10 16:40:52,2,2006-02-15 21:30:53,MARY,SMITH
2,11367,2005-08-02 18:01:38,1440,1,2005-08-04 13:19:38,1,2006-02-15 21:30:53,MARY,SMITH
3,11824,2005-08-17 12:37:54,2639,1,2005-08-19 10:11:54,2,2006-02-15 21:30:53,MARY,SMITH
4,12250,2005-08-18 03:57:29,921,1,2005-08-22 23:05:29,1,2006-02-15 21:30:53,MARY,SMITH
...,...,...,...,...,...,...,...,...,...
5681,14599,2005-08-21 17:43:42,4575,599,2005-08-22 18:53:42,1,2006-02-15 21:30:53,AUSTIN,CINTRON
5682,14719,2005-08-21 21:41:57,4091,599,2005-08-25 20:37:57,1,2006-02-15 21:30:53,AUSTIN,CINTRON
5683,15590,2005-08-23 06:09:44,4048,599,2005-09-01 06:53:44,2,2006-02-15 21:30:53,AUSTIN,CINTRON
5684,15719,2005-08-23 11:08:46,3990,599,2005-08-25 07:25:46,1,2006-02-15 21:30:53,AUSTIN,CINTRON
5685,15725,2005-08-23 11:25:00,378,599,2005-08-26 11:46:00,1,2006-02-15 21:30:53,AUSTIN,CINTRON

In [9]:
#3
#function called rental_count_month . use pandas groupby() 
#input: the df provided by rentals_month  + the month and year 
#returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.
# name the new column according to the month and year, #for example, "rentals_05_2005".

In [29]:
def rental_count_month(rental_month_df, month, year):
    # Filter rows for the specified == month and year
    #dt() is pandas datetime accessor
    filtered_rentals = rental_month_df[(rental_month_df['rental_date'].dt.month == month) 
                                   & (rental_month_df['rental_date'].dt.year == year)]

    # Group by customer_id and count the number of rentals
    rental_counts = filtered_rentals.groupby('customer_id').count().reset_index()

    # Select only customer_id and rental count columns
    rental_counts = rental_counts[['customer_id', 'rental_date']]

    # Rename the rental_date column
    rental_counts.rename(columns={'rental_date': f'rentals_{month:02d}_{year}'}, inplace=True)

    return rental_counts

In [32]:
#trial
month = 6
year = 2005

df_counts = rental_count_month(rentals_month(engine, month, year), month, year)
df_counts

     customer_id  rentals_06_2005
0              1                7
1              2                1
2              3                4
3              4                6
4              5                5
..           ...              ...
585          595                2
586          596                2
587          597                3
588          598                1
589          599                4

[590 rows x 2 columns]

In [12]:
#4
#function called compare_rentals 
#input: two DataFrames containing the number of rentals made by each customer in different months and years. 
#return a combined DataFrame with a new 'difference' column, 
    #which is the difference between the number of rentals in the two months.

In [35]:
def compare_rentals(rentals_df1, rentals_df2):
    # Merge DataFrames on customer_id
    merged_df = pd.merge(rentals_df1, rentals_df2, 
                         on='customer_id', 
                         how='outer', 
                         suffixes=('_month1', '_month2'))

    # Fill NaN values with 0 (for customers who rented in only one of the months)
    merged_df = merged_df.fillna(0)

    # Calculate the difference between the two months
    merged_df['difference'] = merged_df[f'rentals_month2'] - merged_df[f'rentals_month1']

    return merged_df

In [39]:
def compare_rentals(rentals_df1, rentals_df2):
    # Merge DataFrames on customer_id
    merged_df = pd.merge(rentals_df1, rentals_df2, 
                         on='customer_id', 
                         how='outer', 
                         suffixes=('_month1', '_month2'))

    # Fill NaN values with 0 (for customers who rented in only one of the months)
    merged_df = merged_df.fillna(0)

    print("Merged DataFrame:")
    print(merged_df)

    # Extract the column names for rentals in each month
    rental_column_month1 = [col for col in merged_df.columns if 'rentals' in col and '_month1' in col]
    rental_column_month2 = [col for col in merged_df.columns if 'rentals' in col and '_month2' in col]

    print("Columns for month 1:", rental_column_month1)
    print("Columns for month 2:", rental_column_month2)

    # Calculate the difference between the two months
    merged_df['difference'] = merged_df[rental_column_month2[0]] - merged_df[rental_column_month1[0]]

    return merged_df

In [40]:
# trial:
# Assuming you have rental_counts DataFrames for two different months
df_counts_may = rental_count_month(rentals_month(engine, 5, 2005), 5, 2005)
df_counts_june = rental_count_month(rentals_month(engine, 6, 2005), 6, 2005)

may_vs_june = compare_rentals(df_counts_may, df_counts_june)
may_vs_june

Merged DataFrame:
     customer_id  rentals_05_2005  rentals_06_2005
0              1              2.0              7.0
1              2              1.0              1.0
2              3              2.0              4.0
3              5              3.0              5.0
4              6              3.0              4.0
..           ...              ...              ...
593          583              0.0              6.0
594          585              0.0              4.0
595          591              0.0              3.0
596          592              0.0              5.0
597          598              0.0              1.0

[598 rows x 3 columns]
Columns for month 1: []
Columns for month 2: []

IndexError: list index out of range

In [37]:
def compare_rentals(rentals_df1, rentals_df2):
    # Merge DataFrames on customer_id
    merged_df = pd.merge(rentals_df1, rentals_df2, 
                         on='customer_id', 
                         how='outer', 
                         suffixes=('_month1', '_month2'))

    # Fill NaN values with 0 (for customers who rented in only one of the months)
    merged_df = merged_df.fillna(0)

    # Extract the column names for rentals in each month
    rental_column_month1 = [col for col in merged_df.columns if 'rentals' in col and '_month1' in col][0]
    rental_column_month2 = [col for col in merged_df.columns if 'rentals' in col and '_month2' in col][0]

    # Calculate the difference between the two months
    merged_df['difference'] = merged_df[rental_column_month2] - merged_df[rental_column_month1]

    return merged_df

In [41]:
def compare_rentals(rentals_df1, rentals_df2):
    # Merge DataFrames on customer_id
    merged_df = pd.merge(rentals_df1, rentals_df2, 
                         on='customer_id', 
                         how='outer', 
                         suffixes=('_month1', '_month2'))

    # Fill NaN values with 0 (for customers who rented in only one of the months)
    merged_df = merged_df.fillna(0)

    print("Merged DataFrame:")
    print(merged_df)

    # Extract the column names for rentals in each month
    rental_column_month1 = [col for col in merged_df.columns if 'rentals' in col and '_month1' in col]
    rental_column_month2 = [col for col in merged_df.columns if 'rentals' in col and '_month2' in col]

    print("Columns for month 1:", rental_column_month1)
    print("Columns for month 2:", rental_column_month2)

    # Check if any columns were found
    if not rental_column_month1:
        print("No columns found for month 1.")
    if not rental_column_month2:
        print("No columns found for month 2.")

    # Calculate the difference between the two months
    merged_df['difference'] = merged_df[rental_column_month2[0]] - merged_df[rental_column_month1[0]]

    return merged_df
df_counts_may = rental_count_month(rentals_month(engine, 5, 2005), 5, 2005)
df_counts_june = rental_count_month(rentals_month(engine, 6, 2005), 6, 2005)

may_vs_june = compare_rentals(df_counts_may, df_counts_june)
may_vs_june

Merged DataFrame:
     customer_id  rentals_05_2005  rentals_06_2005
0              1              2.0              7.0
1              2              1.0              1.0
2              3              2.0              4.0
3              5              3.0              5.0
4              6              3.0              4.0
..           ...              ...              ...
593          583              0.0              6.0
594          585              0.0              4.0
595          591              0.0              3.0
596          592              0.0              5.0
597          598              0.0              1.0

[598 rows x 3 columns]
Columns for month 1: []
Columns for month 2: []
No columns found for month 1.
No columns found for month 2.

IndexError: list index out of range